// Задача №1. 
// Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.
// a = 25, b = 5 -> да 
// a = 2, b = 10 -> нет 
// a = 9, b = -3 -> да 
// a = -3 b = 9 -> нет

// Console.Write("Введите число №1: ");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите число №2: ");
// int b = Convert.ToInt32(Console.ReadLine());

// if ((b * b) == a)
// {
//    Console.Write("Первое число является квадратом"); 
// }
// else
// {
//      Console.Write("Первое число не является квадратом"); 
// }

// Задача №3.
// Напишите программу, которая будет выдавать название дня недели по заданному номеру.
// 3 -> Среда 
// 5 -> Пятница

// Console.WriteLine("Да начнутся Голодные игры!!!");
// Console.Write("Введите число от 1 до 7 включительно: ");
// int day = Convert.ToInt32(Console.ReadLine());

// if (day == 1)
// {
//    Console.WriteLine("Понедельник");
// }
// else if (day == 2)
// {
//    Console.WriteLine("Вторник");
// }
// else if (day == 3)
// {
//    Console.WriteLine("Среда");
// }
// else if (day == 4)
// {
//    Console.WriteLine("Четверг");
// }
// else if (day == 5)
// {
//    Console.WriteLine("Пятница-развратница");
// }
// else if (day == 6)
// {
//    Console.WriteLine("Суббота");
// }
// else if (day == 7)
// {
//    Console.WriteLine("Воскресенье");
// }
// else 
// {
//    Console.WriteLine("Гражданин, на планете Земля всего 7 дней в неделе.");
// }

// Задача №7. 
// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.
// 	456 -> 6
// 	782 -> 2
// 	918 -> 8

// Console.Write("Введите трехзначное число: ");
// int num = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine(num % 10);





